In [1]:
#@gyleodhis =====gyleodhis@outlook.com===
import numpy as np
import pandas as pd
# pd.__version__ this checks the pandas version in your machine.
#Pandas Series Object
# A Pandas Series is a one-dimensional array of indexed data.
data = pd.Series([0.25,0.5,0.75,1])
data
#data.values 
#data.index

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [2]:
###This explicit index definition gives the series object additional cappabilities.
###For example the index need not be an interger but can consist of values of any desired type.
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                  index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [3]:
###And the item access works as expected:
data['c']

0.75

In [4]:
#We can even use noncontiguous or nonsequential indices:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

## The Pandas DataFrame Object as a Series is an analog of a one-dimensional array with flexible indices, a DataFrame is an analog of a two-dimensional array with both flexible row indices and flexible column names. Consider the  following Series constructed from a python dictionary:

In [5]:
 population_dict = {'Nairobi': 38332521,
                    'Mombasa': 26448193,
                    'Kisumu': 19651127,
                    'Kakamega': 19552860,
                    'Machakos': 12882135}
population = pd.Series(population_dict)
population

Kakamega    19552860
Kisumu      19651127
Machakos    12882135
Mombasa     26448193
Nairobi     38332521
dtype: int64

Let as now construct a new series listing the area of each of the five counties listed above

In [6]:
area_dict = {'Nairobi': 423967, 'Mombasa': 695662, 'Kisumu': 141297,
'Kakamega': 170312, 'Machakos': 149995}
area = pd.Series(area_dict)
area

Kakamega    170312
Kisumu      141297
Machakos    149995
Mombasa     695662
Nairobi     423967
dtype: int64

Now with this along with the population Series from before, we can use a dictionary to construct a single two-dimensional object containing the below information:

In [7]:
counties = pd.DataFrame({'population': population,
'area': area})
counties

            area  population
Kakamega  170312    19552860
Kisumu    141297    19651127
Machakos  149995    12882135
Mombasa   695662    26448193
Nairobi   423967    38332521

In [8]:
#the DataFrame has an index attribute that gives access to the index labels:
counties.index

Index(['Kakamega', 'Kisumu', 'Machakos', 'Mombasa', 'Nairobi'], dtype='object')

In [9]:
#Additionally, the DataFrame has a columns attribute, which is an Index object holding the column labels:
counties.columns

Index(['area', 'population'], dtype='object')

In [10]:
#asking for the 'area' attribute returns the Series object containing the areas we saw earlier this is why the DataFrame behaves like a specialized array:
counties['area']

Kakamega    170312
Kisumu      141297
Machakos    149995
Mombasa     695662
Nairobi     423967
Name: area, dtype: int64

# Data Selection in Series

In [11]:
#Consider the Series below:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [12]:
data.keys() # Returns the keys of the Series.

Index(['a', 'b', 'c', 'd'], dtype='object')

In [13]:
#You can extend a series by assigning to a new index value.
data['e'] = 1.25
data['f'] = 1.50
data['g'] = 1.75
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
f    1.50
g    1.75
dtype: float64

In [14]:
#Slicing a Series by explicit indexing
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [15]:
#Slicing a Series by implicit index
data[0:2]

a    0.25
b    0.50
dtype: float64

Among these, slicing may be the source of the most confusion. Notice that when you
are slicing with an explicit index (i.e., data['a':'c']), the final index is included in
the slice, while when you’re slicing with an implicit index (i.e., data[0:2]), the final
index is excluded from the slice.

In [16]:
#Masking a Series
data[(data>0.3) & (data<0.8)]

b    0.50
c    0.75
dtype: float64

In [17]:
#Fancy Indexing
data[['a','g']]

a    0.25
g    1.75
dtype: float64

# Data Selection in Dataframe
Recall that a DataFrame acts in many ways like a two-dimensional or structured array,
and in other ways like a dictionary of Series structures sharing the same index

## DataFrame as a Dictionary
Reconsider the county dictionary below:

In [18]:
counties

            area  population
Kakamega  170312    19552860
Kisumu    141297    19651127
Machakos  149995    12882135
Mombasa   695662    26448193
Nairobi   423967    38332521

Like with the Series objects discussed earlier, this dictionary-style syntax can also be
used to modify the object, in this case to add a new column:

In [19]:
counties['density'] = counties['population']/counties['area']
counties

            area  population     density
Kakamega  170312    19552860  114.806121
Kisumu    141297    19651127  139.076746
Machakos  149995    12882135   85.883763
Mombasa   695662    26448193   38.018740
Nairobi   423967    38332521   90.413926

## DataFrames as a two-dimensional array
We can examine the raw underlying data array using the values attribute:

In [20]:
counties.values

array([[1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [4.23967000e+05, 3.83325210e+07, 9.04139261e+01]])

With this picture in mind, we can do many familiar array-like observations on the
DataFrame itself. For example, we can transpose the full DataFrame to swap rows and
columns:

In [21]:
counties.T

,Kakamega,Kisumu,Machakos,Mombasa,Nairobi
area,1.703120e+05,1.412970e+05,1.499950e+05,6.956620e+05,4.239670e+05
population,1.955286e+07,1.965113e+07,1.288214e+07,2.644819e+07,3.833252e+07
density,1.148061e+02,1.390767e+02,8.588376e+01,3.801874e+01,9.041393e+01

In [22]:
#passing a single index to an array accesses a row:
counties.values[1]

array([1.41297000e+05, 1.96511270e+07, 1.39076746e+02])

In [23]:
# While passing a single “index” to a DataFrame accesses a column:
counties['area']

Kakamega    170312
Kisumu      141297
Machakos    149995
Mombasa     695662
Nairobi     423967
Name: area, dtype: int64

In [24]:
counties.iloc[:3, :2] #iloc uses implicit indexing (iloc for positional indexing)

            area  population
Kakamega  170312    19552860
Kisumu    141297    19651127
Machakos  149995    12882135

In [25]:
counties.loc[:'Mombasa', :'population'] #returns upto and including the specified index(es) in this case returns rows upto Mombasa and columns upto population.
#.loc for label based indexing

            area  population
Kakamega  170312    19552860
Kisumu    141297    19651127
Machakos  149995    12882135
Mombasa   695662    26448193

## Other usefull indexing conventions.

In [26]:
#First, while indexing refers to columns, slicing refers to rows:
counties['Machakos':'Mombasa'] # Example of slicing

            area  population    density
Machakos  149995    12882135  85.883763
Mombasa   695662    26448193  38.018740

In [27]:
# Such slices can also refer to rows by number rather than by index:
counties[2:3] # Remember that slicing by indexing does not include the final index.

            area  population    density
Machakos  149995    12882135  85.883763

In [28]:
#Similarly, direct masking operations are also interpreted row-wise rather than column-wise:
counties[counties.density<100]

            area  population    density
Machakos  149995    12882135  85.883763
Mombasa   695662    26448193  38.018740
Nairobi   423967    38332521  90.413926

# Data Manupilation
Since Pandas is build on top of Numpy; any numpy ufunc will work on Pandas Sereies and DataFrame objects.
Lets first define a simple Series and DataFrame on which to demonstrate this:

In [29]:
import numpy as np
rng=np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [30]:
df = pd.DataFrame(rng.randint(0,10,(3,4)),
                 columns=['A','B','C','D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [31]:
#If we apply a NumPy ufunc on either of these objects, the result will be another Pandas object with the indices preserved:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [32]:
# Or a slightly more complex calculation:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

## working with incomplete data
Suppose we are working with population and area of major towns in Kenya; assume the ppopulataion data is from a defferent source while the area data is from a different source:

In [33]:
city_area = pd.Series({'Nairobi': 423967, 'Mombasa':695662, 'Kisumu': 141297}, name = "city_area")
city_population = pd.Series({'Kakamega': 19552860, 'Machakos': 12882135, 'Nairobi': 38332521, 'Kisumu': 19651127}, name = 'city_population')

city_population

Kakamega    19552860
Kisumu      19651127
Machakos    12882135
Nairobi     38332521
Name: city_population, dtype: int64

In [34]:
# Let’s see what happens when we divide these to compute the population density:
city_density = city_population/city_area
city_density

Kakamega           NaN
Kisumu      139.076746
Machakos           NaN
Mombasa            NaN
Nairobi      90.413926
dtype: float64

## Any item for which one or the other does not have an entry is marked with NaN, or
## “Not a Number,” which is how Pandas marks missing data .

In [35]:
# More example:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

If using NaN values is not the desired behavior, we can modify the fill value using
appropriate object methods in place of the operators. For example, calling A.add(B)
is equivalent to calling A + B, but allows optional explicit specification of the fill value
for any elements in A or B that might be missing:

In [36]:
A.add(B, fill_value=0) # so addition occurs with 0 instead of NaN.

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

## Ufuncs: Operations Between DataFrame and Series
Operations between a DataFrame and a Series are similar to operations between a two-dimensional and one dimensional NumPy array.

In [37]:
A = rng.randint(10, size=(3, 4))
A

array([[1, 7, 5, 1],
       [4, 0, 9, 5],
       [8, 0, 9, 2]])

In [38]:
A - A[1] #According to NumPy’s broadcasting rules; subtraction/addition between a two-dimensional array and one of its rows is applied row-wise.

array([[-3,  7, -4, -4],
       [ 0,  0,  0,  0],
       [ 4,  0,  0, -3]])

In [39]:
# In Pandas, the convention similarly operates row-wise by default:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  3 -7  4  4
2  7 -7  4  1

In [40]:
# To perform a columnwise operation we use the axis key word
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -6  0 -2 -6
1  4  0  9  5
2  8  0  9  2

# Handling Missing Data
## Trade-offs in missing data conventions
### NaN and None in Pandas
NaN and None both have their place, and Pandas is built to handle the two of them
nearly interchangeably, converting between them where appropriate:

In [41]:
pd.Series([1,np.nan,2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

For types that don’t have an available sentinel value, Pandas automatically type-casts
when NA values are present. For example, if we set a value in an integer array to
np.nan, it will automatically be upcast to a floating-point type to accommodate the
NA:

In [42]:
x = pd.Series(range(4), dtype=int)
x

0    0
1    1
2    2
3    3
dtype: int64

In [43]:
x[2] = None
x

0    0.0
1    1.0
2    NaN
3    3.0
dtype: float64

From the above two examples we notice that in addition to casting the integer array to floating point, Pandas
automatically converts the None to a NaN value.

## Operating on Null Values
there are several useful methods for detecting, removing, and replacing null values in Pandas data structures. They are:
    1. isnull()
        Generate a Boolean mask indicating missing values
    2. notnull()
        Opposite of isnull()
    3. dropna()
        Return a filtered version of the data
    4. fillna()
        Return a copy of the data with missing values filled or imputed

In [44]:
counties.isnull()

           area  population  density
Kakamega  False       False    False
Kisumu    False       False    False
Machakos  False       False    False
Mombasa   False       False    False
Nairobi   False       False    False

In [45]:
# For a DataFrame, there are more options. Consider the following DataFrame:
df = pd.DataFrame([[1, np.nan, 2],
                   [2, 3, 5],
                   [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

## We cannot drop single values from a DataFrame; we can only drop full rows or full columns

In [46]:
# By default, dropna() will drop all rows in which any null value is present:
df. dropna()

     0    1  2
1  2.0  3.0  5

We can however drop NA values along a different axis; axis=1 drops all col‐
umns containing a null value:

In [47]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [48]:
# above methods drop some good data and can lead to huge loses of data. To gain more control on what to drop we use the how or thresh parameters.
df[3] = np.nan # added a third column containing all NaN.
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [49]:
df.dropna(axis = 'columns', how = 'all') # Drops a column that contains all values NaN. (Replce 'all' with 'any' for droping any column with NaN value)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

## For finer-grained control, the thresh parameter lets you specify a minimum number of non-null values for the row/column to be kept:

In [50]:
df.dropna(axis='rows', thresh=3) #This drops the first and last rows, because they contain only two nonnull values.

     0    1  2   3
1  2.0  3.0  5 NaN

# Filling Null Values

In [51]:
# Consider the following Series:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [52]:
data.fillna(5) # Fills all the NaN values with the passed value in this case 5.

a    1.0
b    5.0
c    2.0
d    5.0
e    3.0
dtype: float64

In [53]:
# We can specify a forward-fill to propagate the previous value forward (the previous value before a NaN is placed in the predeeding NaN value.):
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [54]:
# Or we can specify a back-fill to propagate the next values backward:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [55]:
# For DataFrames, the options are similar, but we can also specify an axis along which the fills take place:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [56]:
df.fillna(method='ffill', axis=1) # "axis = 1 works along columns while axis - 0 works n rows."

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

## Notice that during ffill and bfill, if a previous or the next value is not available the NA value remains.

Representing a twdimentional data within a one dimentional Series. The Pandas MultiIndex enables us to perform this.Suppose you want to track the population of cities across two different years. Consider the following:

In [57]:
index = [('Nairobi', 2000), ('Mombasa', 2000), ('Kisumu', 2000), ('Kakamega', 2000),('Nairobi', 2010), ('Mombasa', 2010), ('Kisumu', 2010), ('Kakamega', 2010)]
city_population = [10555760, 10782135, 12332451, 10651103, 19552860, 12882135, 38332521, 19651127]
pop = pd.Series(city_population, index=index)
pop

(Nairobi, 2000)     10555760
(Mombasa, 2000)     10782135
(Kisumu, 2000)      12332451
(Kakamega, 2000)    10651103
(Nairobi, 2010)     19552860
(Mombasa, 2010)     12882135
(Kisumu, 2010)      38332521
(Kakamega, 2010)    19651127
dtype: int64

In [58]:
# We can create a multiindex from the above tuples as follows:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['Kakamega', 'Kisumu', 'Mombasa', 'Nairobi'], [2000, 2010]],
           labels=[[3, 2, 1, 0, 3, 2, 1, 0], [0, 0, 0, 0, 1, 1, 1, 1]])

In [59]:
# We ca see a hierarchical representation of the data when we reindex our series with MultiIndex
pop = pop.reindex(index)
pop
#Here the first two columns of the Series representation show the multiple index values, while the third column shows the data

Nairobi   2000    10555760
Mombasa   2000    10782135
Kisumu    2000    12332451
Kakamega  2000    10651103
Nairobi   2010    19552860
Mombasa   2010    12882135
Kisumu    2010    38332521
Kakamega  2010    19651127
dtype: int64

In [60]:
# Sometimes it is convenient to name the levels of the MultiIndex. You can accomplish this by passing the names argument to any of the above MultiIndex constructors, or by setting the names attribute of the index after the fact:
pop.index.names = ['state', 'year']
pop

state     year
Nairobi   2000    10555760
Mombasa   2000    10782135
Kisumu    2000    12332451
Kakamega  2000    10651103
Nairobi   2010    19552860
Mombasa   2010    12882135
Kisumu    2010    38332521
Kakamega  2010    19651127
dtype: int64

In [61]:
# To access all data for which the second index is 2010, we can simply use the Pandas slicing notation:
pop[:,2010]

state
Nairobi     19552860
Mombasa     12882135
Kisumu      38332521
Kakamega    19651127
dtype: int64

## MultiIndex as extra dimension
You might notice something else here: we could easily have stored the same data
using a simple DataFrame with index and column labels. In fact, Pandas is built with
this equivalence in mind. The unstack() method will quickly convert a multiplyindexed Series into a conventionally indexed DataFrame:

In [62]:
pop_df = pop.unstack()
pop_df

year          2000      2010
state
Kakamega  10651103  19651127
Kisumu    12332451  38332521
Mombasa   10782135  12882135
Nairobi   10555760  19552860

In [63]:
# The .stack() does the opposite. Remember it does not work on a Series but a DataFrame.
pop_df.stack()

state     year
Kakamega  2000    10651103
          2010    19651127
Kisumu    2000    12332451
          2010    38332521
Mombasa   2000    10782135
          2010    12882135
Nairobi   2000    10555760
          2010    19552860
dtype: int64

## we can also use it to represent data of three or more dimensions in a Series or DataFrame. Each extra level in a multi-index represents an extra dimension of data; taking advantage of this property gives us much more flexibility in the types of data we can represent. For example let us add age demographic data about minors under the age of 18.

In [64]:
pop_df = pd.DataFrame({'total': pop,
                      'Under18': [9267089, 9284094,4687374, 4318033,5906301, 6879014,5786301, 9519014]})
pop_df

               Under18     total
state    year
Nairobi  2000  9267089  10555760
Mombasa  2000  9284094  10782135
Kisumu   2000  4687374  12332451
Kakamega 2000  4318033  10651103
Nairobi  2010  5906301  19552860
Mombasa  2010  6879014  12882135
Kisumu   2010  5786301  38332521
Kakamega 2010  9519014  19651127

In [65]:
# Here we can now compute the fraction of people under 18 by year, given the above data:
f_u18 = pop_df['Under18'] / pop_df['total']
f_u18.unstack()

year          2000      2010
state
Kakamega  0.405407  0.484400
Kisumu    0.380085  0.150950
Mombasa   0.861063  0.533996
Nairobi   0.877918  0.302068

## Just as rows can have multiple levels of indices, the columns can have multiple levels as well. Consider the following.

In [66]:

index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      34.0  35.0  31.0  35.9  40.0  38.7
     2      44.0  36.7  54.0  36.7  49.0  36.7
2014 1      23.0  34.9  43.0  36.9  25.0  36.6
     2      37.0  36.7  43.0  36.3  45.0  36.1

This is fundamentally four-dimensional data, where the dimensions are the
subject, the measurement type, the year, and the visit number. With this in place we
can, for example, index the top-level column by the person’s name and get a full Data
Frame containing just that person’s information:

In [67]:
health_data['Sue']

type          HR  Temp
year visit
2013 1      40.0  38.7
     2      49.0  36.7
2014 1      25.0  36.6
     2      45.0  36.1

## For complicated records containing multiple labeled measurements across multipletimes for many subjects (people, countries, cities, etc.), use of hierarchical rows and columns can be extremely convenient!

# Indexing and Slicing a MultiIndex
## Multiply indexed Series

In [68]:
#Consider the multiply indexed Series of state populations we saw earlier:
pop

state     year
Nairobi   2000    10555760
Mombasa   2000    10782135
Kisumu    2000    12332451
Kakamega  2000    10651103
Nairobi   2010    19552860
Mombasa   2010    12882135
Kisumu    2010    38332521
Kakamega  2010    19651127
dtype: int64

In [69]:
# We can access single elements by indexing with multiple terms:
pop['Kakamega', 2010] # or just pop['Kakamega']

19651127

In [70]:
#With sorted indices, we can perform partial indexing on lower levels by passing an empty slice in the first index:
pop[:,2000]

state
Nairobi     10555760
Mombasa     10782135
Kisumu      12332451
Kakamega    10651103
dtype: int64

In [71]:
# Other types of indexing and selection (discussed in “Data Indexing and Selection” on page 107) work as well; for example, selection based on Boolean masks:
pop[pop > 22000000]

state   year
Kisumu  2010    38332521
dtype: int64

In [72]:
# Selection based on fancy indexing also works:
pop [['Nairobi', 'Mombasa']]

state    year
Nairobi  2000    10555760
Mombasa  2000    10782135
Nairobi  2010    19552860
Mombasa  2010    12882135
dtype: int64

# Multiply indexed DataFrames

In [73]:
# Let us reconsider our health dataframe
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      34.0  35.0  31.0  35.9  40.0  38.7
     2      44.0  36.7  54.0  36.7  49.0  36.7
2014 1      23.0  34.9  43.0  36.9  25.0  36.6
     2      37.0  36.7  43.0  36.3  45.0  36.1

In [74]:
# we can recover Sue’s heart rate data with a simple operation:
health_data['Sue','HR']

year  visit
2013  1        40.0
      2        49.0
2014  1        25.0
      2        45.0
Name: (Sue, HR), dtype: float64

## Sorted and Unsorted Indices

In [75]:
# Lets us create a multiIndexed data where the indices are not sorted
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.638505
      2      0.027103
c     1      0.884663
      2      0.590673
b     1      0.198756
      2      0.405584
dtype: float64

In [76]:
# To sort this data we can use the following funcs:
data = data.sort_index()
data

char  int
a     1      0.638505
      2      0.027103
b     1      0.198756
      2      0.405584
c     1      0.884663
      2      0.590673
dtype: float64

In [77]:
# With the index sorted in this way, partial slicing will work as expected:
data['a':'b']

char  int
a     1      0.638505
      2      0.027103
b     1      0.198756
      2      0.405584
dtype: float64

## Stacking and unstacking indices

In [78]:
#it is possible to convert a dataset from a stacked multi-index to a simple two-dimensional representation, optionally specifying the level to use:
pop.unstack(level=0)

state  Kakamega    Kisumu   Mombasa   Nairobi
year
2000   10651103  12332451  10782135  10555760
2010   19651127  38332521  12882135  19552860

In [79]:
# The opposite of unstack() is stack(), which here can be used to recover the original series:
pop.unstack().stack()

state     year
Kakamega  2000    10651103
          2010    19651127
Kisumu    2000    12332451
          2010    38332521
Mombasa   2000    10782135
          2010    12882135
Nairobi   2000    10555760
          2010    19552860
dtype: int64

## Index setting and resetting
Another way to rearrange hierarchical data is to turn the index labels into columns;
this can be accomplished with the reset_index method.

In [80]:
pop_flat = pop.reset_index(name='population')
pop_flat

      state  year  population
0   Nairobi  2000    10555760
1   Mombasa  2000    10782135
2    Kisumu  2000    12332451
3  Kakamega  2000    10651103
4   Nairobi  2010    19552860
5   Mombasa  2010    12882135
6    Kisumu  2010    38332521
7  Kakamega  2010    19651127

# Data Aggregations on Multi-Indices
We’ve previously seen that Pandas has built-in data aggregation methods, such as
mean(), sum(), and max().

In [81]:
# Finding the avarage in the two visits in each year.
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido         Sue
type       HR   Temp    HR  Temp    HR   Temp
year
2013     39.0  35.85  42.5  36.3  44.5  37.70
2014     30.0  35.80  43.0  36.6  35.0  36.35

In [82]:
#By further making use of the axis keyword, we can take the mean among levels on the columns as well:
data_mean.mean(axis=1, level='type')

type    HR       Temp
year
2013  42.0  36.616667
2014  36.0  36.250000

# Combining Datasets: Concat and Append.

In [83]:
# lets look at a simple concatination of Series and DataFrame using Pandas .concat function
# We define a function that creates a dataframe of a particular form:
def make_df(cols, ind):
    """Lets quickly make a dataframe"""
    data = {c: [str(c) + str(i) for i in ind]
           for c in cols}
    return pd.DataFrame(data, ind)
#Example of a dataframe
make_df('ABCDE', range(3))

    A   B   C   D   E
0  A0  B0  C0  D0  E0
1  A1  B1  C1  D1  E1
2  A2  B2  C2  D2  E2

In [84]:
# Concatenating a Series
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [85]:
# Concatinating a datafram
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
print('The first dataframe''\n',df1); print('The second dataframe''\n',df2); print('Final Dataframe''\n',pd.concat([df1, df2]))

The first dataframe
     A   B
1  A1  B1
2  A2  B2
The second dataframe
     A   B
3  A3  B3
4  A4  B4
Final Dataframe
     A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [86]:
# By default, the concatenation takes place row-wise within the DataFrame (i.e.,axis=0). To perform concatination along columns use, the axis=1
print('Final Dataframe''\n',pd.concat([df1, df2], axis=1))

Final Dataframe
      A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

By default, the entries for which no data is available are filled with NA values. To
change this, we can specify one of several options for the join and join_axes param‐
eters of the concatenate function. By default, the join is a union of the input columns
(join='outer'), but we can change this to an intersection of the columns using
join='inner'

In [87]:
print('Final Dataframe''\n',pd.concat([df1, df2], axis=1, join='inner'))

Final Dataframe
 Empty DataFrame
Columns: [A, B, A, B]
Index: []

Catching the repeats as an error. If you’d like to simply verify that the indices in the
result of pd.concat() do not overlap, you can specify the verify_integrity flag.
With this set to True, the concatenation will raise an exception if there are duplicate
indices. Here is an example, where for clarity we’ll catch and print the error message: 
## pd.concat([x, y], verify_integrity=True)

Ignoring the index. Sometimes the index itself does not matter, and you would prefer
it to simply be ignored. You can specify this option using the ignore_index flag. With
this set to True, the concatenation will create a new integer index for the resulting
Series:
## pd.concat([x, y], ignore_index=True)

## Adding Multi-Index Keys
Another alternative is to use the keys option to specify a label
for the data sources; the result will be a hierarchically indexed series containing the
data:

In [88]:
 x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
print(pd.concat([x, y], keys=['Table1', 'Table2']))

           A   B
Table1 0  A0  B0
       1  A1  B1
Table2 2  A2  B2
       3  A3  B3

# The Append Method.
## Because direct array concatenation is so common, Series and DataFrame objects have an append method that can accomplish the same thing in fewer keystrokes.

In [89]:
# Forexample, rather than calling pd.concat([df1, df2]), you can simply call df1.append(df2):
df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

Keep in mind that unlike the append() and extend() methods of Python lists, the
append() method in Pandas does not modify the original object—instead, it creates a
new object with the combined data

# Combining Datasets: Merge and 
## one-to-one joins

In [90]:
# Consider the following dataframes
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [91]:
# To merge the information into a single dataframe
df3 = pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

## Many-to-one joins
These are joins in which one of the two key columns contains duplicate entries:
Consider the following:

In [92]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
pd.merge(df3,df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

## Many-to-Many joins
If the key column in both the left and right array contains duplicates, then the result is a many-to-many merge.
By performing a many-to-many join, we can recover the skills associated with any
individual person:

In [93]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
#print(df5)
print(pd.merge(df1, df5))

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

## Specification of the Merge Key
The On Keyword. This option works only if both the left and right DataFrames have the specified col‐
umn name.

In [94]:
print(df1); print(df2); print(pd.merge(df1, df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

## The left_on and right_on keywords
At times you may wish to merge two datasets with different column names; for exam‐
ple, we may have a dataset in which the employee name is labeled as “name” rather
than “employee”. In this case, we can use the left_on and right_on keywords to
specify the two column names:

In [95]:
df6 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'Salary': [70000, 80000, 120000,90000]})
pd.merge(df1, df6, left_on="employee", right_on="name")

  employee        group  Salary  name
0      Bob   Accounting   70000   Bob
1     Jake  Engineering   80000  Jake
2     Lisa  Engineering  120000  Lisa
3      Sue           HR   90000   Sue

In [96]:
# The result has a redundant column that we can drop if desired—for example, by using the drop() method of DataFrames:
pd.merge(df1, df6, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  Salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

## The left_index and right_index keywords
Sometimes, rather than merging on a column, you would instead like to merge on an index. For example, your data might look like this:

In [97]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [98]:
# To simpify the above we can use join.
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

## Specifying Set Arithmetic for Joins
This comes up when a value appears in one key column but not the other. Consider this example:

In [99]:
df7 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df8 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
print(pd.merge(df7, df8, how='inner')) # the result contains the intersection of the two sets of inputs; this is what is known as an inner join.

   name   food drink
0  Mary  bread  wine

In [100]:
pd.merge(df7, df8, how='outer') # The result is a union of the two sets.

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [101]:
# The left join and right join return join over the left entries and right entries, respectively. For example:
pd.merge(df7, df8, how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

## Overlapping Column Names: The suffixes Keyword
Consider the following:

In [102]:
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                     'rank': [1, 2, 3, 4]})
df10 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                     'rank': [3, 1, 4, 2]})
pd.merge(df9, df10, on="name")

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

Because the output would have two conflicting column names, the merge function
automatically appends a suffix _x or _y to make the output columns unique. If these
defaults are inappropriate, it is possible to specify a custom suffix using the suffixes
keyword:

In [103]:
pd.merge(df9, df10, on="name", suffixes=["Nine", "Ten"])

   name  rankNine  rankTen
0   Bob         1        3
1  Jake         2        1
2  Lisa         3        4
3   Sue         4        2

## US States Data
Merge and join operations come up most often when one is combining data from dif‐
ferent sources. Here we will consider an example of some data about US states and
their populations.

In [14]:
us_pop = pd.read_csv("../data/state-population.csv")
us_areas = pd.read_csv("../data/state-areas.csv")
us_abbrevs = pd.read_csv("../data/state-abbrevs.csv")
print(us_pop.head(), '\n\n'); print(us_areas.head(), '\n\n'); print(us_abbrevs.head())

  State     ages  year  population
0    AL  under18  2012   1117489.0
1    AL    total  2012   4817528.0
2    AL  under18  2010   1130966.0
3    AL    total  2010   4785570.0
4    AL  under18  2011   1125763.0


        State  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707


        State abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

We will now do a many-to-one merge that will give us the full state name within the
population DataFrame. We want to merge based on the state column of the us_pop,
and the abbreviation column of us_abbrevs. We’ll use how='outer' to make sure no
data is thrown away due to mismatched labels.

In [15]:
merged = pd.merge(us_pop, us_abbrevs, how='outer',
                  left_on='State', right_on='abbreviation')
merged = merged.drop('abbreviation', 1) # drop duplicate info
merged

     State_x     ages  year   population  State_y
0         AL  under18  2012    1117489.0  Alabama
1         AL    total  2012    4817528.0  Alabama
2         AL  under18  2010    1130966.0  Alabama
3         AL    total  2010    4785570.0  Alabama
4         AL  under18  2011    1125763.0  Alabama
5         AL    total  2011    4801627.0  Alabama
6         AL    total  2009    4757938.0  Alabama
7         AL  under18  2009    1134192.0  Alabama
8         AL  under18  2013    1111481.0  Alabama
9         AL    total  2013    4833722.0  Alabama
10        AL    total  2007    4672840.0  Alabama
11        AL  under18  2007    1132296.0  Alabama
12        AL    total  2008    4718206.0  Alabama
13        AL  under18  2008    1134927.0  Alabama
14        AL    total  2005    4569805.0  Alabama
15        AL  under18  2005    1117229.0  Alabama
16        AL    total  2006    4628981.0  Alabama
17        AL  under18  2006    1126798.0  Alabama
18        AL    total  2004    4530729.0  Alabama
19        AL  under18  2004    1113662.0  Alabama
20        AL    total  2003    4503491.0  Alabama
21        AL  under18  2003    1113083.0  Alabama
22        AL    total  2001    4467634.0  Alabama
23        AL  under18  2001    1120409.0  Alabama
24        AL    total  2002    4480089.0  Alabama
25        AL  under18  2002    1116590.0  Alabama
26        AL  under18  1999    1121287.0  Alabama
27        AL    total  1999    4430141.0  Alabama
28        AL    total  2000    4452173.0  Alabama
29        AL  under18  2000    1122273.0  Alabama
...      ...      ...   ...          ...      ...
2562     USA  under18  1999   71946051.0      NaN
2563     USA    total  2000  282162411.0      NaN
2564     USA  under18  2000   72376189.0      NaN
2565     USA    total  1999  279040181.0      NaN
2566     USA    total  2001  284968955.0      NaN
2567     USA  under18  2001   72671175.0      NaN
2568     USA    total  2002  287625193.0      NaN
2569     USA  under18  2002   72936457.0      NaN
2570     USA    total  2003  290107933.0      NaN
2571     USA  under18  2003   73100758.0      NaN
2572     USA    total  2004  292805298.0      NaN
2573     USA  under18  2004   73297735.0      NaN
2574     USA    total  2005  295516599.0      NaN
2575     USA  under18  2005   73523669.0      NaN
2576     USA    total  2006  298379912.0      NaN
2577     USA  under18  2006   73757714.0      NaN
2578     USA    total  2007  301231207.0      NaN
2579     USA  under18  2007   74019405.0      NaN
2580     USA    total  2008  304093966.0      NaN
2581     USA  under18  2008   74104602.0      NaN
2582     USA  under18  2013   73585872.0      NaN
2583     USA    total  2013  316128839.0      NaN
2584     USA    total  2009  306771529.0      NaN
2585     USA  under18  2009   74134167.0      NaN
2586     USA  under18  2010   74119556.0      NaN
2587     USA    total  2010  309326295.0      NaN
2588     USA  under18  2011   73902222.0      NaN
2589     USA    total  2011  311582564.0      NaN
2590     USA  under18  2012   73708179.0      NaN
2591     USA    total  2012  313873685.0      NaN

[2592 rows x 5 columns]

In [167]:
# Let’s double-check whether there were any mismatches here, which we can do by looking for rows with nulls:
merged.isnull().any()

State_x       False
ages          False
year          False
population     True
State_y        True
dtype: bool

In [168]:
# We see some entries of population and State_Y are null. Lets figure out what are they:
merged[merged['population'].isnull()].head()

     State_x     ages  year  population      State_y
2496      PR  under18  1990         NaN  Puerto Rico
2497      PR    total  1990         NaN  Puerto Rico
2498      PR    total  1991         NaN  Puerto Rico
2499      PR  under18  1991         NaN  Puerto Rico
2500      PR    total  1993         NaN  Puerto Rico

We can definately see that its data from Puerto Rico prior to the year 2000.
we see also that some of the new state entries are also null, which
means that there was no corresponding entry in the abbrevs key! Let’s figure out
which regions lack this match:

In [169]:
merged.loc[merged['State_y'].isnull(), 'State_x'].unique()

array(['VA', 'USA'], dtype=object)

In [171]:
# To fix this we do the following
merged.loc[merged['State_x'] == 'VA', 'State_y'] = 'Virginia'
merged.loc[merged['State_x'] == 'USA', 'State_y'] = 'United States'

In [163]:
merged.isnull().any()

State_x       False
ages          False
year          False
population     True
State_y       False
state          True
State          True
dtype: bool

## GroupBy: Split,Apply,Combine
    The split step involves breaking up and grouping a DataFrame depending on the
    value of the specified key.
    The apply step involves computing some function, usually an aggregate, transformation,
    or filtering, within the individual groups.
    The combine step merges the results of these operations into an output array

In [3]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [8]:
df.groupby("key")
# Notice what is returned is not a set of DataFrames, but a DataFrame GroupBy object;
## we can think of it as a special view of the Dataframe.

To produce a result, we can apply an aggregate to this DataFrameGroupBy object.
The sum() method below is just one possibility here; we can apply virtually any common
Pandas or NumPy aggregation function, as well as virtually any valid DataFrame
operation.

In [12]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

## The GroupBy Object.
The GroupBy object is a very flexible abstraction. In many ways, you can simply treat
it as if it’s a collection of DataFrames, and it does the difficult things under the hood.
   ## N/B groupby is a "lazy computation." No computation is done untill we call some aggregate on the object.

## The Planets Datasets.

In [4]:
planets = pd.read_csv("../data/planets.csv")
planets.groupby('method').head()

,method,number,orbital_period,mass,distance,year
0,Radial Velocity,1,269.300000,7.10,77.40,2006
1,Radial Velocity,1,874.774000,2.21,56.95,2008
2,Radial Velocity,1,763.000000,2.60,19.84,2011
3,Radial Velocity,1,326.030000,19.40,110.62,2007
4,Radial Velocity,1,516.220000,10.50,119.47,2009
29,Imaging,1,NaN,NaN,45.52,2005
30,Imaging,1,NaN,NaN,165.00,2007
31,Imaging,1,NaN,NaN,140.00,2004
32,Eclipse Timing Variations,1,10220.000000,6.05,NaN,2009
33,Imaging,1,NaN,NaN,NaN,2008
34,Imaging,1,NaN,NaN,145.00,2013
37,Eclipse Timing Variations,2,5767.000000,NaN,130.72,2008
38,Eclipse Timing Variations,2,3321.000000,NaN,130.72,2008
39,Eclipse Timing Variations,2,5573.550000,NaN,500.00,2010
40,Eclipse Timing Variations,2,2883.500000,NaN,500.00,2010
91,Transit,1,1.508956,NaN,NaN,2008
92,Transit,1,1.742994,NaN,200.00,2008
93,Transit,1,4.256800,NaN,680.00,2008
94,Transit,1,9.202050,NaN,NaN,2008
95,Transit,1,4.037896,NaN,NaN,2009
113,Astrometry,1,246.360000,NaN,20.77,2013
537,Astrometry,1,1016.000000,NaN,14.98,2010
680,Transit Timing Variations,2,160.000000,NaN,2119.00,2011
736,Transit Timing Variations,2,57.011000,NaN,855.00,2012
749,Transit Timing Variations,3,NaN,NaN,NaN,2014
787,Orbital Brightness Modulation,2,0.240104,NaN,1180.00,2011
788,Orbital Brightness Modulation,2,0.342887,NaN,1180.00,2011
792,Orbital Brightness Modulation,1,1.544929,NaN,NaN,2013
813,Transit Timing Variations,2,22.339500,NaN,339.00,2013
902,Microlensing,1,NaN,NaN,NaN,2008
903,Microlensing,1,NaN,NaN,NaN,2008
904,Microlensing,1,NaN,NaN,NaN,2009
905,Microlensing,1,NaN,NaN,3600.00,2013
906,Microlensing,1,2780.000000,NaN,NaN,2011
941,Pulsar Timing,3,25.262000,NaN,NaN,1992
942,Pulsar Timing,3,66.541900,NaN,NaN,1992
943,Pulsar Timing,3,98.211400,NaN,NaN,1994
944,Pulsar Timing,1,36525.000000,NaN,NaN,2003
945,Pulsar Timing,1,0.090706,NaN,1200.00,2011
958,Pulsation Timing Variations,1,1170.000000,NaN,NaN,2007

## Column indexing: 
The GroupBy object supports column indexing in the same way as
the DataFrame, and returns a modified GroupBy object. For example:

In [18]:
## planets.groupby("method")["orbital_period"].head()
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

## Iteration over groups:
The GroupBy object supports direct iteration over the groups,returning each group as a Series or DataFrame:

In [16]:
for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

## Dispatch methods.
Through some Python class magic, any method not explicitly
implemented by the GroupBy object will be passed through and called on the groups,
whether they are DataFrame or Series objects. For example, you can use the
describe() method of DataFrames to perform a set of aggregations that describe each
group in the data:

In [16]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

Using groupby() to compute the maximum orbital_period and the maximum distance of the planetsin each method category.
    ## From this we find that the furthest planet was discovered using the Transit method while planets
     discovered using the Pulsation Timing Variations have no distance specified.

In [26]:
planets.groupby('method').aggregate({'orbital_period': np.max,'distance': np.max})

                               distance  orbital_period
method
Astrometry                        20.77     1016.000000
Eclipse Timing Variations        500.00    10220.000000
Imaging                          165.00   730000.000000
Microlensing                    7720.00     5100.000000
Orbital Brightness Modulation   1180.00        1.544929
Pulsar Timing                   1200.00    36525.000000
Pulsation Timing Variations         NaN     1170.000000
Radial Velocity                  354.00    17337.500000
Transit                         8500.00      331.600590
Transit Timing Variations       2119.00      160.000000

## Aggregate, filter, transform, apply
In particular, GroupBy objects have aggregate(),
filter(), transform(), and apply() methods that efficiently implement a variety of
useful operations before combining the grouped data.

In [8]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6)},
                  columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

The aggregate() function can take a string a function or a list.

In [13]:
df.groupby('key').aggregate([np.min, np.median, np.max])

    data1             data2
     amin median amax  amin median amax
key
A       0    1.5    3     3    4.0    5
B       1    2.5    4     0    3.5    7
C       2    3.5    5     3    6.0    9

Another useful pattern is to pass a dictionary mapping column names to operations
to be applied on that column:

In [29]:
df.groupby('key').aggregate({'data1': np.max,'data2': np.min})

     data1  data2
key
A        3      3
B        4      0
C        5      3

## Filtering
A filtering operation allows you to drop data based on the group proper‐
ties. For example, we might want to keep all groups in which the standard deviation is
larger than some critical value:

In [31]:
def filter_func(x):
    return x['data2'].std()>4
print(df.groupby('key').std());
print(df.groupby('key').filter(filter_func))

       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641
  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

## Transformation
While aggregation must return a reduced version of the data, trans‐
formation can return some transformed version of the full data to recombine. For
such a transformation, the output is the same shape as the input. A common example
is to center the data by subtracting the group-wise mean as shown below on the planets data:

In [6]:
planets.groupby('method').transform(lambda x: x - x.std()).head()

     number  orbital_period       mass   distance         year
0 -0.157141     -1185.62621   3.274117  31.840619  2001.750948
1 -0.157141      -580.15221  -1.615883  11.390619  2003.750948
2 -0.157141      -691.92621  -1.225883 -25.719381  2006.750948
3 -0.157141     -1128.89621  15.574117  65.060619  2002.750948
4 -0.157141      -938.70621   6.674117  73.910619  2004.750948

## The apply() method
The apply() method lets you apply an arbitrary function to the
group results. The function should take a DataFrame, and return either a Pandas
object (e.g., DataFrame, Series) or a scalar; the combine operation will be tailored to
the type of output returned

In [9]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x
print(df.groupby('key').apply(norm_by_data2))

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

Using groupby() to group the planets by decades.

In [18]:
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

From the above computation, we see that most of the planets were discovered in the 2010s decade.

## Pivot Tables
The pivot table takes simple columnwise data as input, and groups the entries into a two-dimensional table that provides a multidimensional summarization of the data.
To understand pivot tables let us us the titanic dataset available via seaborn.